import numpy as np

W = np.diag([15191530.11, 2096668.118, 1332201.035, 1812154.76, 1406494.3])
X = ([7.254044444,1],
     [17.92111111,1],
     [27.7729,1],
     [40.3225,1],
     [59.23867778,1])
Y = ([0.000005],
     [0.00001],
     [0.000015],
     [0.00002],
     [0.000025])

Mβ = np.linalg.inv(np.transpose(X) @ W @ X )
β = Mβ @ np.transpose(X) @ W @ Y

print(β)
print(np.sqrt(np.diagonal(Mβ)))

#imprimeix uns valors: [m, n] i [u_m, u_n]
#[[4.12506813e-07][2.17869609e-06]] [1.40679345e-05 3.06734842e-04]
